leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCan_regdef.h
/** \brief  Extended Message Object  Data 3 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA3_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA3;

/** \brief  Extended Message Object  Data 4 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA4_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA4;

/** \brief  Extended Message Object  Data 5 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA5_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA5;

/** \brief  Extended Message Object  Data 6 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_EDATA6_Bits B;               /**< \brief Bitfield access */
} Ifx_CAN_MO_EDATA6;

/** \brief  Message Object  Function Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_FCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_MO_FCR;

/** \brief  Message Object  FIFO/Gateway Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_FGPR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CAN_MO_FGPR;

/** \brief  Message Object  Interrupt Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_IPR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_MO_IPR;

/** \brief  Message Object  Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MO_STAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_CAN_MO_STAT;

/** \brief  Message Index Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MSID_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_MSID;

/** \brief  Message Index Mask Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MSIMASK_Bits B;                 /**< \brief Bitfield access */
} Ifx_CAN_MSIMASK;

/** \brief  Message Pending Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_MSPND_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_MSPND;

/** \brief  Node Bit Timing Extended View Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_BTEVR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CAN_N_BTEVR;

/** \brief  Node Bit Timing Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_BTR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_N_BTR;

/** \brief  Node Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_CR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_N_CR;

/** \brief  Node Error Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_ECNT_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_N_ECNT;

/** \brief  Fast Node Bit Timing Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_FBTR_Bits B;                  /**< \brief Bitfield access */
} Ifx_CAN_N_FBTR;

/** \brief  Node Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_FCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_N_FCR;

/** \brief  Node Interrupt Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_IPR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_N_IPR;

/** \brief  Node Port Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_PCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_CAN_N_PCR;

/** \brief  Node Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CAN_N_SR_Bits B;                    /**< \brief Bitfield access */
} Ifx_CAN_N_SR;

